# SQLite with Pandas

In [2]:
import pandas as pd
import sqlite3

# Creating a Connection

In [3]:
conn = sqlite3.connect("example2.db")
cur = conn.cursor()

In [4]:
cur.execute("SELECT * FROM customer")
cur.fetchall()

[('Balveer', 'Singh', 43500.0),
 ('Balveer', 'Singh', 43500.0),
 ('Balveer', 'Singh', 43500.0),
 ('Sujoy', 'Dey', 40000.0),
 ('Nikunj', 'Sharma', 35000.0),
 ('Anshu', 'Sharma', 50000.0)]

# Creation of a DataFrame(Pandas)

In [5]:
df = pd.read_sql_query("SELECT * FROM customer", conn)

In [6]:
df

      Name Last_Name   Income
0  Balveer     Singh  43500.0
1  Balveer     Singh  43500.0
2  Balveer     Singh  43500.0
3    Sujoy       Dey  40000.0
4   Nikunj    Sharma  35000.0
5    Anshu    Sharma  50000.0

# Running Queries

In [8]:
pd.read_sql("select * from customer where Name = 'Balveer'", conn)

      Name Last_Name   Income
0  Balveer     Singh  43500.0
1  Balveer     Singh  43500.0
2  Balveer     Singh  43500.0

In [9]:
pd.read_sql("select Name, Income from customer", conn)

      Name   Income
0  Balveer  43500.0
1  Balveer  43500.0
2  Balveer  43500.0
3    Sujoy  40000.0
4   Nikunj  35000.0
5    Anshu  50000.0

In [11]:
pd.read_sql("select Name, Income from customer order by Income desc", conn)

      Name   Income
0    Anshu  50000.0
1  Balveer  43500.0
2  Balveer  43500.0
3  Balveer  43500.0
4    Sujoy  40000.0
5   Nikunj  35000.0

# Read CSV with Pandas

In [12]:
pd.read_csv("Sample.csv")

      Name   Age
0  Balveer    22
1    Favio    35
2      Anu    54
3     Esha    20
4     Asha    25

In [14]:
sample_df = pd.read_csv("Sample.csv")

In [15]:
type(sample_df)

pandas.core.frame.DataFrame

In [16]:
sample_df.head(2)

      Name   Age
0  Balveer    22
1    Favio    35

# Creating a table in SQLite from a CSV file with Pandas

In [17]:
sample_df = pd.read_csv("Sample.csv")

In [18]:
sample_df.to_sql("Sample_table", conn, if_exists = "replace", index = False)

5

In [19]:
pd.read_sql("select * from Sample_table", conn)

      Name   Age
0  Balveer    22
1    Favio    35
2      Anu    54
3     Esha    20
4     Asha    25

# Funtion to get all table info

In [20]:
conn = sqlite3.connect("example2.db")
cur = conn.cursor()

In [30]:
def table_info(conn, cursor):
    """
    Print out all the columns of every table in the DB
    
    conn: DB Connection Object
    Cursor: Cursor Object
    """
    tables = cur.execute("select Name from sqlite_master where type='table';") .fetchall()
    for table_name in tables:
        table_name = table_name[0]
        table = pd.read_sql("select * from {} LIMIT 0".format(table_name), conn)
        print(table_name)
        for col in table.columns:
            print("\t "+col)
            print()

In [31]:
table_info(conn, cur)

customer
	 Name

	 Last_Name

	 Income

Sample_table
	 Name

	  Age

# See table Schema with SQLite

In [33]:
cur.execute("PRAGMA table_info('customer')").fetchall()

[(0, 'Name', 'TEXT', 0, None, 0),
 (1, 'Last_Name', 'TEXT', 0, None, 0),
 (2, 'Income', 'REAL', 0, None, 0)]